app/controllers/user/camp_sites_controller.rb

SELECT "camp_sites".* FROM "camp_sites"
---
  def index
    @camp_sites = CampSite.all

SELECT  "camp_sites".* FROM "camp_sites" WHERE "camp_sites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "plans".* FROM "plans" WHERE "plans"."camp_site_id" = ?  [["camp_site_id", 1]]
---
  def show
    @camp_site = CampSite.find(params[:id])
    # @plans = @camp_site.plans
    # @plan = @camp_site.plan.find(params[:plan_id])
    @reservations = @camp_site.reservations.includes(:user, :plan)