app/controllers/user/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "post_code" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["post_code", "0000000"], ["address", "hoge"], ["updated_at", "2023-06-29 07:38:08.930194"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)