app/controllers/camp_site/camp_sites_controller.rb

UPDATE "camp_sites" SET "name" = ?, "about" = ?, "post_code" = ?, "address" = ?, "phone_number" = ?, "updated_at" = ? WHERE "camp_sites"."id" = ?  [["name", "サンプルキャンプ場"], ["about", "このキャンプ場は、サンプルキャンプ場です。"], ["post_code", "0000000"], ["address", "サンプル"], ["phone_number", "00000000000"], ["updated_at", "2023-08-05 08:31:29.484137"], ["id", 1]]
---
  def update
    @camp_site = current_camp_site
    if @camp_site.update(camp_site_params)