app/controllers/camp_site/plans_controller.rb

  def create
    @plan = @camp_site.plans.build(plan_params)
    if @plan.save
---
INSERT INTO "plans" ("name", "price", "about", "camp_site_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "サンプルサイト5"], ["price", 5000], ["about", "このプランは、サンプルプランの5です。"], ["camp_site_id", 1], ["created_at", "2023-08-09 04:20:24.617767"], ["updated_at", "2023-08-09 04:20:24.617767"]]

  def update
    @plan = Plan.find(params[:id])
    if @plan.update(plan_params)
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "plans" SET "price" = ?, "updated_at" = ? WHERE "plans"."id" = ?  [["price", 2222], ["updated_at", "2023-08-07 03:47:44.483032"], ["id", 11]]

  def destroy
    @plan.destroy
---
DELETE FROM "plans" WHERE "plans"."id" = ?  [["id", 1]]

  def set_plan
    @plan = Plan.find_by(id: params[:id], camp_site_id: @camp_site.id)
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? AND "plans"."camp_site_id" = ? LIMIT ?  [["id", 9], ["camp_site_id", 1], ["LIMIT", 1]]