app/controllers/camp_site/users_controller.rb

SELECT  "camp_sites".* FROM "camp_sites" WHERE "camp_sites"."id" = ? ORDER BY "camp_sites"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_camp_site
    @camp_site = CampSite.find(params[:camp_site_id])