app/views/camp_site/users/index.html.erb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 1]]
---
        <% @users.each do |user| %>
          <% user.reservations.each do |reservation| %>