app/views/user/camp_sites/show.html.erb

      <h2>プラン一覧</h2>
      <% @camp_site.plans.each do |plan| %>
---
SELECT "plans".* FROM "plans" WHERE "plans"."camp_site_id" = ?  [["camp_site_id", 1]]