app/controllers/users/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "0@0"], ["LIMIT", 1]]
---
  def reject_user
    @user = User.find_by(email: params[:user][:email].downcase)